# DataFrame vs SQL

In [2]:
import pandas as pd
import numpy as np

In [4]:
emp = pd.read_csv("./lec08_emp.csv", parse_dates=['HIREDATE'])
emp.head(3)
# 컬럼이름 소문자변경
emp.columns = emp.columns.str.lower()

In [ ]:
# emp=pd.read_csv("./lec08_emp.csv",sep=",",parse_dates=['HIREDATE'])
# emp.colums=emp.columns.str.lower()

## Select문

ORACLE 문법  
SELECT * FROM EMP;  

DataFrame 문법  
<font hidden>
    ```emp```
<font>

In [6]:
emp.head()

   empno   ename       job     mgr   hiredate   sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

ORACLE 문법   
SELECT ENAME FROM EMP;  

DataFrame 문법  
<font hidden>
```emp['ename']```    
<font>

In [7]:
emp['ename']

0      SMITH
1      ALLEN
2       WARD
3      JONES
4     MARTIN
5      BLAKE
6        CCC
7      SCOTT
8       KING
9     TURNER
10     ADAMS
11     JAMES
12      FORD
13    MILLER
Name: ename, dtype: object

ORACLE 문법  
SELECT ENAME, EMPNO FROM EMP;  

DataFrame 문법  
<font hidden>
    `emp[  ['empno', 'ename']  ]`
<font>

In [10]:
emp[['ename','empno']].head()

    ename  empno
0   SMITH   7369
1   ALLEN   7499
2    WARD   7521
3   JONES   7566
4  MARTIN   7654

ORACLE 문법  
SELECT EMPNO, ENAME  
FROM EMP  
WHERE ROWNUM <= 3;

DataFrame 문법  
<font hidden>
    `emp.loc[0:2, ['empno','ename']]`
<font>

In [11]:
emp[['empno','ename']][emp['deptno']==10]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

### iloc, loc 문법

### 값 뽑아보기 연습

In [3]:
# emp.iloc[헹]
# emp.iloc[3]               # 단일값
# emp.iloc[  [0,3,5]  ]     # 여러값
# emp.iloc[ 0: 3]           # 슬라이스

# emp.iloc[행,열]
# emp.iloc[0, 1]            # 단일값
# emp.iloc[ 0, [0,3]]       # 여러값
# emp.iloc[ 0:3, 2:4]         # 슬라이스

In [4]:
# emp.loc[행값, 열값]                     **주의 값임!
# emp.loc[0, 'ename']                    # 단일값, 단일값
# emp.loc[[1,2,3], ['empno','ename']]    # 여러값, 여러값
# emp.loc[ 0:3, 'empno':'mgr']           # 슬라이싱, 슬라이싱(** 여기는 미만이 아님(3, mgr포함) **)

## Where 조건

<hr>

<font size=5 style=bold >사용법</font>  
df[조건]  
df[조건][컬럼]  
df[컬럼][조건]

ORACLE 문법  
SELECT * FROM EMP WHERE DEPTNO = 10;

DataFrame 문법  
<font hidden>
    `emp[  emp['deptno'] ==10  ]`
<font>

### 단일조건
ORACLE 문법  
SELECT EMPNO, ENAME FROM EMP WHERE DEPTNO = 10;

DataFrame 문법
<font hidden>
    `emp[ emp['deptno'] == 10  ][  ['empno', 'ename']   ]`  
<font>


**내가생각한 문제   iloc에 조건을 걸수있을까 iloc으로 df로 뽑고  **   
emp.iloc[1:5, :][ emp['deptno'] == 20]['ename']

### 멀티조건
ORACLE 문법  
SELECT EMPNO, ENAME, SAL FROM EMP WHERE DEPTNO = 10 AND SAL > 2000;

DataFrame 문법  
<font hidden>
    `emp[ ['empno', 'ename'] ][ (emp['deptno'] == 10) & (emp['sal'] > 2000) ]`
<font>

In [12]:
emp[['empno','ename','sal']][(emp['deptno']==10)&(emp['sal']>2000)]

   empno ename   sal
6   7782   CCC  2450
8   7839  KING  5000

## Subquery 비추

### 문제1  
사번이 7369인 사원의 직업과 같은 사원들의 이름, 직업 출력  
ORACLE 문법  
SELECT ENAME, JOB  
FROM EMP  
WHERE JOB =  
(SELECT JOB  
FROM EMP  
WHERE EMPNO = 7369);

DataFrame 문법  
<font hidden>
    `emp['job'][(emp['empno'] == 7369)].values[0]`  
    `job7369 = emp['job'][(emp['empno'] == 7369)].values[0]`  
    `emp[ ['ename', 'job'] ][  emp['job']  ==  job7369  ]`      
<font>

In [62]:
emp['job'][emp['empno']==7369]

Series([], Name: job, dtype: object)

### 문제2
10번부서 사람들의 직업과 같은 사원의 사원들의 이름, 직업 출력  
ORACLE 문법  
SELECT ENAME, JOB  
FROM EMP  
WHERE JOB IN (SELECT JOB FROM EMP WHERE DEPTNO = 10);

DataFrame 문법  
<font hidden>
    `job10_arr = emp['job'][ emp['deptno'] == 10 ].values`  
    `emp[['ename', 'job']][ emp['job'].isin( job10_arr )   ]`
<font>

In [66]:
empjob=emp['job'][emp['deptno']==10]
emp[['ename','job']][emp['job'].isin(empjob)]

     ename      job
6      CCC  sales10
8     KING  sales10
13  MILLER  sales10

## 컬럼연산

### 문제1
합치기
ORACLE 문법  
SELECT JOB||ENAME FROM EMP  
SELECT CONCAT(JOB, ENAME) FROM EMP  

DataFrame 문법  
<font hidden>
    emp['job'] + emp['ename']
<font>

In [13]:
emp['job']+emp['ename']

0         CLERKSMITH
1      SALESMANALLEN
2       SALESMANWARD
3       MANAGERJONES
4     SALESMANMARTIN
5       MANAGERBLAKE
6         MANAGERCCC
7       ANALYSTSCOTT
8      PRESIDENTKING
9     SALESMANTURNER
10        CLERKADAMS
11        CLERKJAMES
12       ANALYSTFORD
13       CLERKMILLER
dtype: object

### 문제2
연봉뽑기  
ORACLE 문법   
SELECT SAL*12 AS ASAL FROM EMP;  

DataFrame 문법  
<font hidden>
    `emp['asal'] = emp['sal'] * 12`
<font>

In [15]:
emp['asal']=emp['sal']*12
emp.head()

   empno   ename       job     mgr   hiredate   sal    comm  deptno   asal
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20   9600
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30  19200
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30  15000
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20  35700
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30  15000

## 결측처리
* df.dropna()
* df['comm'].fillna(0) -- nvl(comm, 0)
* emp['comm'].isna() --------

### 문제 1
ORACLE 문법  
SELECT COMM, NVL(COMM, 0) AS COMM2 FROM EMP;  

DataFrame 문법  
<font hidden>
`emp['comm2'] = emp['comm'].fillna(0)`  
`emp[['comm', 'comm2']]`
<font>

In [17]:
emp['comm2']=emp['comm'].fillna(0)
emp.head()

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2
0,7369,SMITH,CLERK,7902.0,1980-12-17,800,NaN,20,9600,0.0
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,300.0,30,19200,300.0
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,500.0,30,15000,500.0
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,NaN,20,35700,0.0
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250,1400.0,30,15000,1400.0

## GROUP 조건

### 문제1
각부서별 사원수 출력  
ORACLE 문법  
SELECT DEPTNO, COUNT(1) AS 사원수  
FROM EMP  
GROUP BY DEPTNO  
ORDER BY DEPTNO;  

DataFrame 문법  
<font hidden>
    emp.groupby('deptno')['deptno'].count()
<font>

In [19]:
emp.groupby("deptno")['deptno'].count()

deptno
10    3
20    5
30    6
Name: deptno, dtype: int64

### 문제2
각부서별 급여 합  
ORACLE 문법  
SELECT DEPTNO, sum(sal)
FROM EMP  
GROUP BY DEPTNO;  

DataFrame 문법  
<font hidden>
    emp.groupby('deptno')['sal'].sum()
<font>

In [20]:
emp.groupby("deptno")['sal'].sum()

deptno
10     8750
20    10875
30     9400
Name: sal, dtype: int64

### 문제3
부서별 최대 최소 급여  
ORACLE 문법  
SELECT DEPTNO, MAX(SAL), MIN(SAL)  
FROM EMP  
GROUP BY DEPTNO;

DataFrame 문법  
<font hidden>
    emp.groupby('deptno')['sal'].min()
    emp.groupby("deptno").agg(  {"sal":"max", "comm" : "min"}   )
    emp.groupby("deptno").agg(  {"sal":"max", "sal" : "min"}   ) --에러 (key가 같아서 오류)
    emp.groupby("deptno")["sal"].agg(  ["max", "min"]   )
<font>

In [23]:
emp.groupby("deptno")['sal'].agg(['max','min'])

         max   min
deptno
10      5000  1300
20      3000   800
30      2850   950

### 문제4
각 부서별 급여 합, 최대, 최소, 평균  
ORACLE 문법  
SELECT DEPTNO, SUM(SAL), MAX(SAL), MIN(SAL), ROUND(AVG(SAL),0), count(1)  
FROM EMP  
GROUP BY DEPTNO;  

DataFrame 문법  
<font hidden>
    emp.groupby('deptno')["sal"].agg( ["sum", "max", "min", "mean", 'count', 'std', 'var'] )
<font>

In [24]:
emp.groupby("deptno")['sal'].agg(['max','sum','min','mean','count'])

         max    sum   min         mean  count
deptno
10      5000   8750  1300  2916.666667      3
20      3000  10875   800  2175.000000      5
30      2850   9400   950  1566.666667      6

## 정렬

### 문제1
ORACLE 문법  
SELECT SAL FROM EMP ORDER BY SAL DESC;

DataFrame 문법  
<font hidden>
    emp['sal'].sort_values(ascending=True)
<font>

In [26]:
emp['sal'].sort_values( ascending=False)

8     5000
7     3000
12    3000
3     2975
5     2850
6     2450
1     1600
9     1500
13    1300
2     1250
4     1250
10    1100
11     950
0      800
Name: sal, dtype: int64

### 문제2
ORACLE 문법  
SELECT EMPNO, ENAME, SAL FROM EMP WHERE DEPTNO = 20 ORDER BY ENAME ASC;

DataFrame 문법  
<font hidden>
    e = emp[  ['empno', 'ename', 'sal'] ][ emp['deptno'] == 20]
    e.sort_values(by=['ename'], ascending=True)
<font>

In [27]:
emp[['empno','ename','sal']][emp['deptno']==20].sort_values(by='ename' )

    empno  ename   sal
10   7876  ADAMS  1100
12   7902   FORD  3000
3    7566  JONES  2975
7    7788  SCOTT  3000
0    7369  SMITH   800

### 문제3
ORACLE 문법  
SELECT EMPNO, DEPTNO, SAL FROM EMP ORDER BY DEPTNO ASC, SAL DESC;

DataFrame 문법  
<font hidden>
    emp[['empno', 'deptno', 'sal']].sort_values(by=["deptno","sal"], ascending=[True, False])
<font>

In [30]:
emp[['empno','deptno','sal']].sort_values(['deptno','sal'],ascending=[True,False]).head()

    empno  deptno   sal
8    7839      10  5000
6    7782      10  2450
13   7934      10  1300
7    7788      20  3000
12   7902      20  3000

In [5]:
# 인덱스로 소트하기
# emp.sort_index(ascending=False)

## UPDATE
at, iat은 단일값 변경만 가능 (여러개는 불가)  
* df[기존컬럼] = 값   ---> 수정  
* df[신규컬럼] = 값   ---> 신규컬럼생성  
df.at[행값, 열값] = 변경값  
df.iat[행idx, 열idx] = 변경값

여러개를 할 때는 loc, iloc을 사용한다.  
df.loc[행값, 열값] = 변경값  
df.loc[행idx, 열idx] = 변경값

### 문제1
ORACLE 문법  
UPDATE EMP  
SET COMM = 999;

DataFrame 문법  
<font hidden>
    emp['comm'] = 99999
<font>

In [32]:
emp['comm']=999
emp.head(2)

   empno  ename       job     mgr   hiredate   sal  comm  deptno   asal  comm2
0   7369  SMITH     CLERK  7902.0 1980-12-17   800   999      20   9600    0.0
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600   999      30  19200  300.0

### 문제2
ORACLE 문법  
UPDATE EMP
SET ENAME = 'SSSMITHSS'
WHERE 첫번째데이터

DataFrame 문법  
<font hidden>
emp.at[0, "ename"] 'SSSMITHSS'
emp.at[0, 1] 'SSSMITHSS'

<font>

In [38]:
emp.at[0,'ename']='sssss'
emp.iat[1,2]='cle'

emp.loc[[2,4],'ename']='sdfsf'
emp.iloc[2:4,6]=8080
emp.head()

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2
0,7369,sssss,CLERK,7902.0,1980-12-17,800,999,20,9600,0.0
1,7499,ALLEN,cle,7698.0,1981-02-20,1600,999,30,19200,300.0
2,7521,sdfsf,SALESMAN,7698.0,1981-02-22,1250,8080,30,15000,500.0
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,8080,20,35700,0.0
4,7654,sdfsf,SALESMAN,7698.0,1981-09-28,1250,999,30,15000,1400.0

## np.where() vs df.where()

방법 2가지 (   
np.where(조건절, 참값, 거짓값),    -- decode(deptno, 10, '십', '그외')   
df[컬럼A].where(조건문, 거짓값))   -- 조건만족하면 컬럼A, 그렇지않으면 거짓값

### 문제1
ORACLE 문법  
UPDATE EMP
SET JOB = 'SALES10'
WHERE DEPTNO = 10;

DataFrame 문법  
<font hidden>
    emp['job'] = np.where(emp['deptno'] == 10, 'SALES10', emp['job']).sort_values(by='deptno')
<font>

In [49]:
emp['deptno_str']=np.where(emp['deptno']==10,'십','그외')
emp.sort_values('deptno').head()

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str
6,7782,CCC,sales10,7839.0,1981-06-09,2450,999,10,29400,0.0,십
8,7839,KING,sales10,NaN,1981-11-17,5000,999,10,60000,0.0,십
13,7934,MILLER,sales10,7782.0,1982-01-23,1300,999,10,15600,0.0,십
0,7369,sssss,CLERK,7902.0,1980-12-17,800,999,20,9600,0.0,그외
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,8080,20,35700,0.0,그외

### 문제2
ORACLE 문법  
UPDATE EMP
SET JOB = 'SALES10'
WHERE DEPTNO = 10;


DataFrame 문법  
<font hidden>
    emp['job'] = emp['job'].where(emp['deptno'] != 10, 'SALES1111')
<font>

In [50]:
emp['job']=np.where(emp['deptno']==10,'sales10',emp['job'])
emp.sort_values('deptno').head()

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str
6,7782,CCC,sales10,7839.0,1981-06-09,2450,999,10,29400,0.0,십
8,7839,KING,sales10,NaN,1981-11-17,5000,999,10,60000,0.0,십
13,7934,MILLER,sales10,7782.0,1982-01-23,1300,999,10,15600,0.0,십
0,7369,sssss,CLERK,7902.0,1980-12-17,800,999,20,9600,0.0,그외
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,8080,20,35700,0.0,그외

## DELETE
* DML : delete from emp; -- 데이터 삭제
* DDL : drop table emp;  -- 테이블 삭제
* drop(**인덱스값**, axis= 0) .... dropna()   데이터행 삭제(가로지우기)
* drop(**컬럼명**, axis=1) .... dropna()      컬럼삭제 (세로지우기)
* del emp                -- 데이터프레임 삭제 drop table과 유사

### 문제1
ORACLE 문법  
DELETE FROM EMP WHERE ROWNUM ==1

DataFrame 문법  
<font hidden>
    emp = emp.drop(1, axis=0)
<font>

In [58]:
emp=emp.drop("asal",axis=1)
emp.head()

,empno,ename,job,mgr,hiredate,sal,comm,deptno,comm2,deptno_str
2,7521,sdfsf,SALESMAN,7698.0,1981-02-22,1250,8080,30,500.0,그외
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850,999,30,0.0,그외
6,7782,CCC,sales10,7839.0,1981-06-09,2450,999,10,0.0,십
7,7788,SCOTT,ANALYST,7566.0,1987-07-13,3000,999,20,0.0,그외
8,7839,KING,sales10,NaN,1981-11-17,5000,999,10,0.0,십

### 문제2
ORACLE 문법  
DELETE FROM EMP


DataFrame 문법  
<font hidden>
    emp = emp.drop('ename', axis=1)
<font>

In [59]:
empcp=emp.copy()

In [60]:
del empcp

In [61]:
empcp

NameError: name 'empcp' is not defined